 DeviceFileEvents
  | where Timestamp > ago(1d)
  | where InitiatingProcessCommandLine has "accepteula"
  | where FolderPath has "\\\\" and FileName endswith ".exe"
  | extend Exe = countof(InitiatingProcessCommandLine, ".exe")
  | where InitiatingProcessCommandLine !has ".ps1" and Exe > 1 or
  InitiatingProcessCommandLine has ".bat"
  | where not(InitiatingProcessCommandLine has_any("batch", "auditpol",
  "script", "scripts", "illusive", "rebootrequired"))
  | summarize FileCount = dcount(FolderPath), make_set(SHA1), make_set(FolderPath),
  make_set(FileName), make_set(InitiatingProcessCommandLine) by DeviceId,
  TimeWindow=bin(Timestamp, 10m), InitiatingProcessFileName
  | where FileCount > 4
